run/rhoVoF/rotateSubstrate/reducedCaseCHTtestRealVeloSR/common/system/solid/fvSolutionMMA
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//Direct copy from Jun
//script declares the solving algos for the specific field variables
//NONE HAVE BEEN VERIFIED, only parameterization lifted...

solvers
{
    "alpha.water.*" //Scheufler has very different settings for this solver!
    {
        advectionScheme   isoAdvection;
        isoFaceTol      1e-11;
        surfCellTol     1e-8;
        nAlphaBounds    3;
        snapTol         1e-12;
        clip            true;
        reconstructionScheme plicRDF;
        nAlphaSubCycles 1;
        cAlpha          1; // Note: cAlpha is not used by isoAdvector but must
                           // be specified because interfacePropertes object
                           // reads it during construction.
    }


    ".*(rho|rhoFinal)"
    {
        solver          diagonal;
    }

    "pcorr.*" //Scheufler has very different settings for this solver!
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;	//Why has this one not a parameterization (luis)
        relTol          0;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        DICGaussSeidel;
        tolerance       1.0e-9;	//@!p_tol!@;
        relTol          0.001;
    }

    p_rghFinal //Scheufler has very different settings for this solver!
    {
        $p_rgh;
        tolerance       1.0e-9;	//@!p_tol!@;
        relTol          0;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1.0e-8;	//@!u_tol!@;
        relTol          0;
    }

    "(T|k|B|nuTilda).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-08;
        relTol          0;
    }
}


PIMPLE
{
    momentumPredictor no;
    nCorrectors     4;	//@!n_correctors!@; //THIS VALUE IS set in default.parameter and in setup.parameter...!!!
    nOuterCorrectors 3;	//@!n_outer_correctors!@;	//Wolfdynamics recommand a value of atleast 5 for moving bodies and to use Piso-ita or Pimple(luis) The other parameterfile sets 30?!
    nNonOrthogonalCorrectors 0;	//@!n_non_orth_correctors!@;
    pRefCell        0;
    pRefValue       0;			//wolfdynamics also adds "correctPhi	yes;"??? (luis)
}


// ************************************************************************* //

