run/rhoVoF/rotateSubstrate/reducedCaseCHTtestRealVeloSR/common/system/fluid/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    boundary
    {
        fluidBottom		//fluid_to_solid	//(luis): siehe solid changeDictionaryDict
        {
            type            mappedWall;
            inGroups        1 ( wall ); //I think we need to define this differently when we do only blockmesh...
            sampleMode      nearestPatchFace;
            sampleRegion    solid;
            samplePatch     solidTop;	//solid_to_fluid;
        }
    }
}

// ************************************************************************* //
