run/rhoVoF/rotateSubstrate/reducedCaseCHTtestRealVeloSR/common/system/fluid/setExprFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//Direct copy from Jun
//Not verified or edited, basically

// do some speed calcs
rpm                   800; //200;     //@!rpm!@; <- This was a parameterization placeholder! (Other values can be 200,400, 600, 800) ((Jun has 200 800 in his default file, probably missing a double dash!
omega   #eval{$rpm*2*pi()/60};        //determine angular velocity!


// Preload any required fields (optional)
readFields      ( U alpha.water);

expressions
(
    U
    {
        field       U;
        dimensions  [0 1 -1 0 0 0 0];

        constants
        {
            limit 1e-6;
        }

/*        variables
        (
            "radius = 0.001"
        );*/

        fieldMask
        #{
          alpha.water > $[(scalar)constants.limit] //I think this one just calles the the value of limit which is defined in constants whic is a scalar, and checks which cells have a value of alpha.water which is below this threshold
        #};

        expression
        #{
           vector (0.0, -6.12, -4.15)	//-3.1 luis: meassured from pics -5.2, but too fast now, maybe middle? Do we even have gravity still applied on the droplet if we basically here do a setFlow operation?
        #};
    }
);


// ************************************************************************* //
